# MYSQL Database Creation
**Author:** Michael McCann <br>
**Last Updated:** 29 May 2022


<u>Overview:</u> <br>
With data collection from IMDB and TMDB complete I need to load the data into MySQL and create a relational databases for access and use with SQL. 

<u>Tasks:</u><br> 
- Load in our CSVs 
- Normalize Data
- Create Schema
- Create SQL Table and Read in Data

<u>Other:</u><br>
NA

## Imports

In [1]:
import pandas as pd
import numpy as np
import json

import pymysql
from sqlalchemy import create_engine
from sqlalchemy.types import*
from sqlalchemy_utils import create_database, database_exists

# Create Database

In [2]:
# Load SQL creds
with open('../../.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'password'])

## Create Connection to MYSQL

In [3]:
# create connection
database = "movieDB"
conn = f"mysql+pymysql://{login['user']}:{login['password']}@localhost/{database}"

# create engine
engine = create_engine(conn)

## Create Database

In [4]:
# Create Database (and check to make sure you don't overwrite)
if database_exists(conn) == False:
    create_database(conn)
else:
    print('the database already exists')

the database already exists

# Create SQL Tables

## title_basics

### Read In and Inspect Data

In [5]:
basics = pd.read_csv("data/title_basics.csv.gz")

display(basics.head(2))

,tconst,primaryTitle,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,70,Drama

In [6]:
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,primaryTitle,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,70,Drama,[Drama]

### Normalize Genres Column

In [7]:
genres_split = basics['genres'].str.split(',')
unique_genres = sorted(genres_split.explode().unique())

In [8]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
# Save out exploded_genres to create title_genre later
exploded_genres = basics.explode('genres_split')
exploded_genres.head(2)

,tconst,primaryTitle,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,118,"Comedy,Fantasy,Romance",Fantasy

Eliminate extra columns from title_basics.
- 'genres' and 'genres_split': are now captured in our genre table.

In [10]:
# Clean extra columns (and repeat genre columns) from basics
basics = basics.drop(columns = ['genres', 'genres_split'])

### Create Table

In [11]:
# Check Datatypes for Schema
basics.dtypes

tconst            object
primaryTitle      object
runtimeMinutes     int64
dtype: object

In [12]:
# Find length of object types
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

# Create schema
basics_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear":Float(),
    "runtimeMinutes": Integer()}

In [13]:
# Create title_basics table
basics.to_sql('title_basics', engine, dtype=basics_schema,
              if_exists = 'replace', index = False)

In [14]:
# Set Primary Key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [15]:
# Check table
q = '''
SELECT *
FROM title_basics
LIMIT 5; '''
pd.read_sql(q, engine)

,tconst,primaryTitle,runtimeMinutes
0,tt0035423,Kate & Leopold,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,70
2,tt0069049,The Other Side of the Wind,122
3,tt0088751,The Naked Monster,100
4,tt0093119,Grizzly II: Revenge,74

## title_ratings

### Read In and Inspect Data

In [16]:
ratings = pd.read_csv("data/title_ratings.csv.gz")
display(ratings.head(2))

      tconst  averageRating  numVotes
0  tt0000001            5.7      1882
1  tt0000002            5.9       250

In [17]:
# Check Datatypes for Schema
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

### Create Table

In [18]:
# Find length of object types
key_len = basics['tconst'].fillna('').map(len).max()

# Create Schema
ratings_schema = {
    "tconst": String(key_len+1),
    "averageRating":Float(),
    "numVotes": Integer()}

In [19]:
# Create title_ratings table
ratings.to_sql('title_ratings', engine, dtype=ratings_schema,
               if_exists='replace', index=False)

In [20]:
# Set Primary Key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [21]:
# Check table
q = '''
SELECT *
FROM title_ratings
LIMIT 5; '''
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1882
1  tt0000002            5.9       250
2  tt0000003            6.5      1664
3  tt0000004            5.8       163
4  tt0000005            6.2      2487

## title_genres - split from title_basics

In [22]:
# Use exploded_genres generated earlier to create cross table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns = 'genres_split', inplace = True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### Create Table

In [23]:
# Check Datatypes for Schema
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [24]:
# Find length of object types
key_len = title_genres['tconst'].fillna('').map(len).max()

# Create Schema
title_genres_schema = {
    "tconst": String(key_len+1),
    "genre_id": Integer() }

In [25]:
# Create title_genres table
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema,
                   if_exists='replace', index=False)

In [26]:
# Check table
q = '''
SELECT *
FROM title_genres
LIMIT 5; '''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## genres - split from title_basics

### Create DataFrame

In [27]:
# Turn mapping dictionary into a Dataframe
genres = pd.DataFrame({'genre_name': genre_map.keys(), 'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Create Table

In [28]:
# Check Datatypes for Schema
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [29]:
# Find length of object types
name_len = genres['genre_name'].fillna('').map(len).max()

# Create Schema
genres_schema = {
    "genre_name": Text(name_len+1),
    "genre_id": Integer() }

In [30]:
# Create genres table
genres.to_sql('genres', engine, dtype=genres_schema,
              if_exists='replace', index=False)

In [31]:
# Set Primary Key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`)')

In [32]:
# Check table
q = '''
SELECT *
FROM genres
LIMIT 5; '''
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## tmdb_data

### Read In and Inspect Data

In [33]:
tmdb_data = pd.read_csv('data/tmdb_merged.csv.gz')

tmdb_data.head()

,tconst,belongs_to_collection,production_companies,production_countries,status,certification,year,month,day,budget_adj,revenue_adj,profit_adj
0,tt0113026,0,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",Released,NaN,2000,9,22,15735772.36,0.00,-15735772.36
1,tt0113092,0,"[{'id': 7405, 'logo_path': '/rfnws0uY8rsNAsrLb...","[{'iso_3166_1': 'US', 'name': 'United States o...",Released,NaN,2000,11,15,0.00,0.00,0.00
2,tt0116391,0,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",Released,NaN,2000,4,14,0.00,0.00,0.00
3,tt0118694,0,"[{'id': 539, 'logo_path': None, 'name': 'Block...","[{'iso_3166_1': 'CN', 'name': 'China'}, {'iso_...",Released,PG,2000,9,29,236036.59,20228261.41,19992224.82
4,tt0118852,0,"[{'id': 67930, 'logo_path': None, 'name': 'Cha...","[{'iso_3166_1': 'US', 'name': 'United States o...",Released,R,2000,9,2,0.00,0.00,0.00

Split off release date information, production company, and production country for separate table creation.

In [34]:
# Split release date into its own df for table creation
release_date = tmdb_data[['tconst', 'year', 'month']]
title_prodco = tmdb_data[['tconst', 'production_companies']]
title_prodcountry = tmdb_data[['tconst', 'production_countries']]
                               
tmdb_data = tmdb_data.drop(columns = ['year', 'month', 'day',
                                      'production_companies', 'production_countries'])

### Create Table

In [35]:
# Check Datatypes for Schema
tmdb_data.dtypes

tconst                    object
belongs_to_collection      int64
status                    object
certification             object
budget_adj               float64
revenue_adj              float64
profit_adj               float64
dtype: object

In [36]:
# Find length of object types
key_len = tmdb_data['tconst'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
status_len = tmdb_data['status'].fillna('').map(len).max()

# Create Schema
tmdb_schema = {
    'tconst': String(key_len+1),
    'revenue_adj': Float(),
    'budget_adj': Float(),
    'profit_adj': Float(),
    'certification': Text(cert_len+1),
    'status': Text(status_len+1),
    'belongs_to_collection': Float()}

In [37]:
# Create tmdb_table
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema,
                 if_exists='replace', index=False)

In [38]:
# Set Primary Key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

In [39]:
# Check table
q = '''
SELECT *
FROM tmdb_data
LIMIT 5; '''
pd.read_sql(q,engine)

,tconst,belongs_to_collection,status,certification,budget_adj,revenue_adj,profit_adj
0,tt0035423,0.0,Released,PG-13,73441900.0,116312000.0,42870300.0
1,tt0062336,0.0,Released,None,0.0,0.0,0.0
2,tt0069049,0.0,Released,R,12949200.0,0.0,-12949200.0
3,tt0088751,0.0,Released,None,485609.0,0.0,-485609.0
4,tt0093119,1.0,Released,None,7852350.0,0.0,-7852350.0

## release_date - split from TMDB

In [40]:
# DF created under TMDB_data steps
release_date.head()

      tconst  year  month
0  tt0113026  2000      9
1  tt0113092  2000     11
2  tt0116391  2000      4
3  tt0118694  2000      9
4  tt0118852  2000      9

### Create Table

In [41]:
# Find length of object types
key_len = release_date['tconst'].fillna('').map(len).max()

# Create Schema
release_date_schema = {
    "tconst": String(key_len+1),
    "year": Integer(),
    "month": Integer()}

In [42]:
# Create tmdb_table
release_date.to_sql('release_date', engine, dtype=release_date_schema,
                 if_exists='replace', index=False)

In [43]:
# Set Primary Key
engine.execute('ALTER TABLE release_date ADD PRIMARY KEY (`tconst`);')

In [44]:
q = '''
SELECT *
FROM release_date
LIMIT 5; '''

pd.read_sql(q, engine)

      tconst  year  month
0  tt0035423  2001     12
1  tt0062336  2020      2
2  tt0069049  2018     11
3  tt0088751  2005      4
4  tt0093119  2020      2

## title_prodco - split from TMDB

### Normalize Production Companies

In [45]:
# DF created under TMDB_data steps
title_prodco.head(2)

      tconst                               production_companies
0  tt0113026  [{'id': 51207, 'logo_path': None, 'name': 'Sul...
1  tt0113092  [{'id': 7405, 'logo_path': '/rfnws0uY8rsNAsrLb...

In [46]:
test = title_prodco['production_companies'][0]

In [47]:
import re
exp= r"(?:\'name\'\:.\'(\w*.*?)\')"
re.findall(exp, test)

['Sullivan Street Productions',
 'Michael Ritchie Productions',
 'Radmin Company, The',
 'United Artists']

In [48]:
def get_prod_company_names(x):
    if x=='[]':
        return ["MISSING"]
    
    exp= r"\'name\'\:.?\'(\w*.*?)\'"
    companies = re.findall(exp, x)
    return companies

get_prod_company_names(test)

['Sullivan Street Productions',
 'Michael Ritchie Productions',
 'Radmin Company, The',
 'United Artists']

In [49]:
title_prodco['prod_company'] = title_prodco['production_companies'].apply(get_prod_company_names)
title_prodco.head(2)

,tconst,production_companies,prod_company
0,tt0113026,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[Sullivan Street Productions, Michael Ritchie ..."
1,tt0113092,"[{'id': 7405, 'logo_path': '/rfnws0uY8rsNAsrLb...","[Dimension Films, Grand Design Entertainment, ..."

In [50]:
exploded_prodco = title_prodco.explode('prod_company')
exploded_prodco = exploded_prodco.dropna()

unique_prodco = exploded_prodco['prod_company'].unique()

In [51]:
prodco_ints = range(len(unique_prodco))
prodco_map = dict(zip(unique_prodco, prodco_ints))

In [52]:
# Use exploded_genres generated earlier to create cross table
title_prodco = exploded_prodco[['tconst', 'prod_company']].copy()
title_prodco['prodco_id'] = title_prodco['prod_company'].map(prodco_map)
title_prodco.drop(columns = 'prod_company', inplace = True)
title_prodco.head()

      tconst  prodco_id
0  tt0113026          0
0  tt0113026          1
0  tt0113026          2
0  tt0113026          3
1  tt0113092          4

### Create Table

In [53]:
title_prodco.dtypes

tconst       object
prodco_id     int64
dtype: object

In [54]:
key_len = title_prodco['tconst'].fillna('').map(len).max()

# Create Schema
title_prodco_schema = {
    "tconst": String(key_len+1),
    "prodco_id": Integer()}

In [55]:
# Create title_genres table
title_prodco.to_sql('title_prodco', engine, dtype=title_prodco_schema,
                   if_exists='replace', index=False)

In [56]:
# Check Table 
q = '''
SELECT *
FROM title_prodco
LIMIT 5; '''

pd.read_sql(q, engine)

      tconst  prodco_id
0  tt0113026          0
1  tt0113026          1
2  tt0113026          2
3  tt0113026          3
4  tt0113092          4

## prod_companies - split from TMDB

### Create DataFrame

In [57]:
# Turn mapping dictionary into a Dataframe
prodco = pd.DataFrame({'product_company': prodco_map.keys(), 'prodco_id': prodco_map.values()})
prodco.head()

               product_company  prodco_id
0  Sullivan Street Productions          0
1  Michael Ritchie Productions          1
2          Radmin Company, The          2
3               United Artists          3
4              Dimension Films          4

### Create Table

In [58]:
prodco.dtypes

product_company    object
prodco_id           int64
dtype: object

In [59]:
prodco_len = prodco['product_company'].fillna('').map(len).max()

# Create Schema
prodco_schema = {
    "product_company": Text(prodco_len+1),
    "prodco_id": Integer()
}

In [60]:
prodco.to_sql('prodco', engine, dtype=prodco_schema, 
              if_exists='replace', index = False)

In [61]:
engine.execute('ALTER TABLE prodco ADD PRIMARY KEY (`prodco_id`)')

In [62]:
q = '''
SELECT *
FROM prodco
LIMIT 5; '''
pd.read_sql(q,engine)

               product_company  prodco_id
0  Sullivan Street Productions          0
1  Michael Ritchie Productions          1
2          Radmin Company, The          2
3               United Artists          3
4              Dimension Films          4

# Tables Check

In [63]:
# Check that all 5 tables have been loaded in properly
q = ''' SHOW TABLES'''

pd.read_sql(q,engine)

  Tables_in_moviedb
0            genres
1            prodco
2      release_date
3      title_basics
4      title_genres
5      title_prodco
6     title_ratings
7         tmdb_data